In [ ]:
Q1. List any five functions of the pandas library with execution.

In [10]:
1 read_csv()
2 head()
3 tail()
4 describe()
5 iloc()

In [29]:
# 1 read_csv
import pandas as pd
df=pd.read_csv("services.csv")

In [30]:
# 2 head()
df.head(3)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN
2,3,3,NaN,NaN,NaN,Phone for information (403-4300 Ext. 4322).,Older adults age 55 or over who can benefit fr...,Offers supportive counseling services to San M...,Resident of San Mateo County age 55 or over,NaN,...,NaN,"Geriatric Counseling, Older Adults, Gay, Lesbi...",NaN,Senior Peer Counseling,NaN,San Mateo County,active,Varies.,NaN,NaN

In [31]:
# 3 tail()
df.tail(2)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
21,22,22,NaN,"Cash, Check, Credit Card",Fotos para pasaportes,Walk in or apply by phone or mail,"Profit and nonprofit businesses, the public, m...",[NOTE THIS IS NOT A REAL SERVICE--THIS IS FOR ...,None,passports@example.org,...,We offer 3-way interpretation services over th...,"Salud, Medicina",Spanish,Passport Photos,Government-issued picture identification,"Alameda County, San Mateo County",active,No wait to 2 weeks.,http://www.example.com,"105, 108, 108-05, 108-05-01, 111, 111-05"
22,23,22,NaN,NaN,NaN,Walk in or apply by phone or mail,"Second service and nonprofit businesses, the p...",[NOTE THIS IS NOT A REAL ORGANIZATION--THIS IS...,None,NaN,...,NaN,"Ruby on Rails/Postgres/Redis, testing, wic",NaN,Example Service Name,NaN,"San Mateo County, Alameda County",active,No wait to 2 weeks,http://www.example.com,NaN

In [32]:
 # 4 describe()
df.describe()

             id  location_id  program_id
count  23.00000    23.000000         0.0
mean   12.00000    11.956522         NaN
std     6.78233     6.711444         NaN
min     1.00000     1.000000         NaN
25%     6.50000     6.500000         NaN
50%    12.00000    12.000000         NaN
75%    17.50000    17.500000         NaN
max    23.00000    22.000000         NaN

In [33]:
# 5 iloc()
df.iloc[0:2,[0,1,2]]

   id  location_id  program_id
0   1            1         NaN
1   2            2         NaN

In [ ]:
Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [58]:
import pandas as pd
data = {'A': ['Alice', 'Bob', 'Claire'],
        'B': [25, 30, 27],
        'C':['Female','Male','Female']}

In [59]:
df = pd.DataFrame(data)
df

        A   B       C
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [66]:

a=[1,5,7]
df.reindex(a,fill_value=100)

     A    B     C
1  Bob   30  Male
5  100  100   100
7  100  100   100

In [70]:
df.reindex(columns=[1,2,3],fill_value=43)

    1   2   3
0  43  43  43
1  43  43  43
2  43  43  43

In [ ]:
Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [80]:
import pandas as pd
data={"Values":[10,20,30,40,50]}
df=pd.DataFrame(data)
df["Values"][0]+df["Values"][1]+df["Values"][2]

60

In [ ]:
Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [87]:
import pandas as pd
data={"Text":[1,2,3,4]}
df=pd.DataFrame(data)
df['Word_Count']=df['Text']

In [89]:
df

   Text  Word_Count
0     1           1
1     2           2
2     3           3
3     4           4

In [ ]:
Q5. How are DataFrame.size() and DataFrame.shape() different?

In [96]:
# size()
# Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.
df.size

8

In [98]:
# shape()
# Returns tuple of shape (Rows, columns) of dataframe/series

df.shape

(4, 2)

In [ ]:
Q6. Which function of pandas do we use to read an excel file?
Ans
Pandas read_excel() - Reading Excel File in Python

In [ ]:
Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [5]:
import pandas as pd

data={"Email":["karun.@domain.com","shubham.@domain.com"]}

In [6]:
df=pd.DataFrame(data)

In [7]:
df

                 Email
0    karun.@domain.com
1  shubham.@domain.com

In [16]:
df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])

In [17]:
df

                 Email  Username
0    karun.@domain.com    karun.
1  shubham.@domain.com  shubham.

In [ ]:
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:

In [ ]:
  Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [31]:
# Ans
date = pd.date_range(start='2023-01-1' , end = '2023-01-5')

In [32]:
df=pd.DataFrame(date,columns=['Date'])

In [33]:
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [34]:
df['Day']=df['Date'].dt.day_name()

In [35]:
df

        Date        Day
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday